## Desafio:

1) Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.
2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
3) Confira a quantidade linhas e colunas desse DataFrame
4) Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

1) Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.

In [1]:
import pandas as pd

url = "dataset/alunos.csv" # Armazenando o arquivo em uma variável
dados = pd.read_csv(url) # Armazenando meu arquivo de leitura dentro de uma variavel, transformando assim em um objeto(DataFrame)
type(dados) # Mostra o tipo de dado.

pandas.core.frame.DataFrame

2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas

In [2]:
dados.head(7) # Visualizando as 7 primeiras linhas do meu DataFrame

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

Ultimas 5 linhas da tabela

In [3]:
dados.tail() # Mostra as ultimas 5 linhas da minha tabela

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

3) Confira a quantidade linhas e colunas desse DataFrame

In [4]:
dados.shape # O shape é uma propriedade que verifica a quantidade de linhas que nesse caso é 18 e colunas que nesse caso é 4

(18, 4)

In [5]:
dados.columns # Quantidade de colunas

Index(['Nome', 'Idade', 'Notas', 'Aprovado'], dtype='object')

4) Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

In [6]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 582.0+ bytes

In [7]:
dados['Nome']

0           Ary
1           Ana
2         Cátia
3         Denis
4          Beto
5         Bruna
6          Dara
7        Carlos
8         Alice
9         Vitor
10       Daniel
11         Igor
12    Sthefanie
13        Mirla
14        Paulo
15       Mylena
16        Lucas
17        Nadia
Name: Nome, dtype: object